/*
    객체의 일반적인 정의, 목적
    여러 변수들을 의미 단위로 하나로 묶어서 사용할 수 있는 방식 중 하나.

    JS에서 원시 값(Primitive value)을 제외한 모든 것은 객체.
    array, function...

    기본적인 차이는 원시 값은 하나의 값 만을 나타내지만,
    객체는 다양한 타입의 값들을 하나의 단위로 구성한 복합 자료구조.

    원시값은 변경 불가능한 값(immutable value),
    객체는 변경 가능한 값(mutable value).

    객체는 프로퍼티(property, 속성)로 구성된 집합,
    프로퍼티는 키(key)와 값(value)으로 구성됨.

    JS에서 사용할 수 있는 모든 값은 프로퍼티 값이 될 수 있음.
    함수는 일급 객체이기 때문에 값이 될 수 있고, 따라서
    객체의 프로퍼티가 될 수 있음.
    프로퍼티 값이 함수일 경우 함수와 구분하기 위해 메서드라고 부름.

    
*/